rails_api/app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" ORDER BY created_at DESC
---
    def index
      transactions = Transaction.order('created_at DESC');

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      transaction = Transaction.find(params[:id])

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 3]]
---
    def destroy
      transaction = Transaction.find(params[:id])
      transaction.destroy